package com.museum.api.common.exception;



/**
 * 异常信息
 * 
 * @author 沈杭春
 * @since 2016-11-7
 */
public enum InheaterSOAExceptionMessage {
	
	
	W00001("用户权限错误"),
	
	//登录注册
	
	W10001("请填写手机号"),
	W10002("请填写密码"),
	W10003("未找到设备Token"),
	W10004("系统无此账号"),
	W10005("该手机号已经注册"),
	W10006("两次密码输入不一致"),
	W10007("用户密码错误"),
	
	W10008("请输入公司全称"),
	W10009("请输入公司类型"),
	W10010("请完善地址"),
	W10011("请输入公司注册号"),
	W10012("请输入公司简介"),
	W10013("请上传营业执照图片"),
	
	W10014("请输入姓名"),
	W10015("请选择性别"),
	W10016("请选择生日"),
	W10017("请选择工种"),
	W10018("请输入身份证号"),
	W10019("请上传身份证图片"),
	
	W20001("请选择工种"),
	W20002("请输入需要人数"),
	W20003("请选择性别"),
	W20004("请完善工作地点"),
	W20005("请输入工单开始时间"),
	W20006("请输入工单结束时间"),
	W20007("请输入工作待遇"),
	W20008("请选择招工类型"),
	W20009("请选择招工项目"),
	W20010("团队用户不能招聘团队"),
	W20011("该状态工单不能修改"),
	
	
	W30001("只有团队身份才能创建团队"),
	W30002("请填写团队名"),
	W30003("请填写团队工种"),
	W30004("请填写团队电话"),
	W30005("请选择写团队头像"),
	W30006("成员已经在团队中"),
	W30007("你已经创建了团队"),
	
	W40001("请填写部门名称"),
	W40002("请选择上级部门"),
	W40003("请选择上级部门负责人"),
	W40004("该人员已经添加为负责人"),
	W40005("该部门下有人员，不能删除"),
	W40006("该部门下有子部门，不能删除"),
	W40007("请选择部门负责人"),
	W40008("该员工为部门领导，暂时不能删除"),
	W40009("该员工为部门领导，暂时不能更换部门"),
	;
	
	
	private String message;

	private InheaterSOAExceptionMessage(String message) {
		this.message = message;
	}

	@Override
	public String toString() {
		return this.message;
	}
}
